{
  "name": "Francis Mwendwa",
  "label": "Cloud and Network Security",
  "image_path": "portfolio_media/fra.jpg",
  "contact": {
    "email": "Francismwendwa230@gmail.com",
    "phone": "+254740532715",
    "location": "Nairobi, Kenya"
  },
  "summary": "Cloud and Network Practitioner with 2+ hands-on experience in DevOps, network security, and cloud architecture. Skilled in Python, AWS, and Linux environments, with a strong foundation in deploying secure, scalable solutions. Holds a Bachelor’s degree in Information Technology and certifications in AWS Solution Architect Associate and Cisco Cybersecurity. Now seeking to leverage this expertise into a dynamic role in cloud engineering, DevOps, or IT project coordination.",
  "url": "127.0.0.1:5500",
  "social_links": [
    
    {
      "label": "LinkedIn",
      "url": "https://www.linkedin.com/in/francis-mwendwa-mutiso/",
      "svg_path": "img/linkedin.svg"
    },
    {
      "label": "Instagram",
      "url": "https://www.instagram.com/_francis_mwendwa/",
      "svg_path": "img/instagram.svg"
    },
    {
      "label": "Github",
      "url": "https://github.com/francismwendwa",
      "svg_path": "img/github.svg"
    }
  ],
  "work_experience": [
    {
      "company": "Cyber Shujaa",
      "position": "Cloud and Network Security Engineer",
      "start_date": "12/05/2025",
      "end_date": "Present",
      "summary": "I am currently working as a Cloud and Network Security Engineer at Cyber Shujaa. In this role, I focus on securing cloud infrastructure, deploying security controls, and managing network operations. I support secure system design, threat detection, and incident response. My responsibilities include configuring firewalls, implementing encryption, conducting vulnerability assessments, and ensuring compliance with industry standards. I also collaborate with IT teams to enhance security awareness and participate in risk assessments.",
      "highlights": [
        "Implementing secure cloud architectures using AWS practices, including identity and access management (IAM), encryption, and multi-factor authentication (MFA).",
        "Configuring and managing firewalls, intrusion detection systems (IDS), and VPNs to protect networks from unauthorized access.",
        "Conducting regular vulnerability assessments and penetration testing using tools like Nessus.",
        "Developing security documentation and incident response playbooks to improve organizational resilience against cyber threats."
      ]
    },
    {
      "company": "MINISTRY OF EDUCATION",
      "position": "ICT OFFICER",
      "start_date": "13/02/2023",
      "end_date": "10/06/2024",
      "summary": "I worked as an EMIS (Education Management Information System) officer at the Ministry of Education.  Supporting data administration, analysis, and reporting for educational statistics and performance indicators was the main responsibility of my position.  I assisted with data entry, database upkeep, data cleaning, and report generation that influenced planning and policy decisions.  I also worked with IT personnel and education officers to improve data quality and expedite procedures.",
      "highlights": [
        "To troubleshoot network performance, begin by identifying issues and ensuring physical connections",
        "Verify configurations with 'show' commands like 'show running-config' on Cisco devices.",
        "Monitor resources with commands like 'show processes cpu' to check CPU.",
        "Test connectivity using ping and traceroute tools, and verify DNS resolution. Review system logs for errors and engage with ISPs if needed.",
        "Keep firmware and software updated, and document findings and solutions for future reference and knowledge sharing"
      ]
    },
    {
      "company": "AICO Management Consultant",
      "position": "Devops Intern",
      "url": "https://www.linkedin.com/company/aicomanagementgroup/",
      "start_date": "10/10/2022",
      "end_date": "17/04/2023",
      "summary": "At AICO, I worked as part of a technology-focused team, helping to set up and manage cloud-based systems and enterprise solutions. My responsibilities included deploying applications, maintaining system security, and troubleshooting issues. I also worked closely with other team members to improve system performance and made sure everything ran smoothly.",
      "highlights": [
        "Primary role was to assist the DevOps team in development of cutting-edge solutions using Microsoft Azure and YOLOv5, optimizing models for accuracy and efficiency.",
        "Orchestrated seamless model training and deployment pipelines. After achieving optimal model weights, I collaborated with UI/UX developers by pushing outputs to GitHub, ensuring integration into user interfaces.",
        "Through continuous experimentation and collaboration, I refined models for superior performance across diverse datasets. This involved close coordination with cross-functional teams to align technical solutions with business objectives."
      ]
    }
  ],
  "projects": [
    {
      "title": "Math Power Calculator",
      "summary": "I developed a math calculator that allows users to compute the result of raising any number to the power of another number. The tool takes a base and an exponent as inputs and calculates the result efficiently. It leverages 5 AWS services: ",
      "url": "https://staging.d1uox9gr9rd3tw.amplifyapp.com/",
      "highlights": [
        "AWS Lambda for the serverless backend logic.",
        "API Gateway to expose the calculator as an API.",
        "S3 for static file hosting.",
        "DynamoDB for storing calculation logs.",
        "CloudWatch for monitoring and logging."
      ],
      "images": [
        {
          "image_path": "portfolio_media/pomimage.png",
          "caption": "Math Power Calculator"
        }
      ]
    }
  ],
  "volunteer_experience": [
    {
      "organization": "Utafiti Football Club",
      "position": "Secritary",
      "start_date": "2019",
      "end_date": "2022",
      "summary": "As Secretary of Utafiti Football Club, I was responsible for overseeing the club’s administrative operations, maintaining records, and ensuring effective communication between team members, management, and external stakeholders. My duties included organizing meetings, preparing agendas and minutes, coordinating match fixtures, managing correspondence, and supporting team logistics.",
      "highlights": []
    }
  ],
  "education": [
    {
      "institution": "Kenyatta University",
      "location": "Nairobi, Kenya",
      "degrees": [
        "Bachelor of Science in Information Technology"
      ],
      "gpa_cumulative": "59.63",
      "graduation_date": "2019"
    }
  ],
  "skills": [
    {
      "name": "Python, Flask, Django",
      "proficiency": 100,
      "proficiency_label": "Expert"
    },
    {
      "name": "System Administration, Linux",
      "proficiency": 90,
      "proficiency_label": "Advanced"
    },
    {
      "name": "JavaScript, HTML, CSS",
      "proficiency": 75,
      "proficiency_label": "Comfortable"
    }
  ],
  "interests": [
    {
      "name": "Football",
      "summary": "I have a strong passion for football, both as a player and a fan. The sport has taught me valuable life skills such as teamwork, discipline, resilience, and strategic thinking. Whether on the pitch or supporting my favorite teams, football keeps me active, engaged, and connected with others who share the same enthusiasm for the game."
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    },
    {
      "language": "Swahili",
      "fluency": "Native speaker"
    }
  ],
  "references": [
    {
      "name": "Elizabeth Muiruri",
      "relation": "Previous Boss",
      "position": "Assistant quality assurance",
      "Contact" : "Upon request"
    },
    {
      "name": "James Gichia Kabebe",
      "relation": "Previous Boss",
      "position": "Curriculum Support Officer",
      "Contact" : "Upon request"
    }
  ]
}
